app/controllers/api_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def authorize_request
      header = request.headers['Authorization']

      # The Authorization header is in the format of "Bearer <jwt>"
      # we split by space to get the token
      token = header.split(' ')[1]
      begin
          @user_jwt = jwt_decode(token)
          @current_user = User.find(@user_jwt[:user_id])