app/controllers/foods_controller.rb

  def get
    render json: Food.all.as_json, status: 200
---
SELECT "foods".* FROM "foods"