app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create_user
        userParams = params.require(:user)
          .permit(:name, :email, :password, :password_confirmation)
        user = User.new(userParams);
        if user.save()

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def get_by_id
        # the user_id param comes from our route
        user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "bw@email.com"], ["LIMIT", 1]]
---
    def get_token
        # Get the user by email
        user = User.find_by_email(params[:email])